give @p written_book{pages:['[["ヒヨコ鑑定士データパックを導入して頂き、誠にありがとうございます。\\nこのデータパックはヒヨコ\\n(アイテム)を鑑定すると、\\n報酬が手に入る。と言う\\nシステムになっています。\\nこのデータパックを始めるために、まず次のページのチュートリアルを読んでみましょう。\\n\\n\\ndatapack制作sousi0125"]]','[["チュートリアル\\nまず、鑑定を始めるために虫眼鏡を用意します。\\n(レシピは4ページ目)\\n虫眼鏡を手に持ってヒヨコを見ると、ヒヨコが鑑定可能かがわかります。\\n虫眼鏡を持ったまま、\\nデフォルトshift+右ボタン\\n(右クリック)でヒヨコを\\n入手できます。\\n\\n\\n             鑑定の方法→"]]','[["鑑定の方法\\n鑑定をするにはヒヨコを手に持ち、オスだと思ったなら右クリック、メスだと思ったならshift+右クリックで鑑定できます。\\n鑑定が合っていたらエメラルド,金,鉄などの報酬を手に入れることが出来、成長したニワトリが足元にスポーンします。\\n鑑定が合っていなかった場合は、鑑定できないヒヨコが足元にスポーンします。"]]','[["虫眼鏡のレシピ\\n\\n",{"text":"","color":"white"}]]'],title:"ひよこ鑑定士データパックについて",author:"熟練ひよこ鑑定士",display:{Lore:['["",{"text":"データパック取説vol.2","italic":false}]']}} 1

recipe take @s hiyokodayo:hiyoko_book

clear @s knowledge_book 1

advancement revoke @s only hiyokodayo:craft/hiyokobookad